Repository: PS-2024-bogdan-iamnitchi/MVC-architecture-35
Catalog: MVC-architecture-35/Language/strings.*.resx
Languages: de, fr

# addFailure
source: Adding was ended with failure!
de: Das Hinzufügen wurde mit einem Fehler beendet!
fr: L'ajout s'est terminé par un échec !

# addSuccess
source: Adding was completed successfully!
de: Das Hinzufügen wurde erfolgreich abgeschlossen!
fr: L'ajout a été effectué avec succès !

# adminBtn
source: ADMIN
de: ADMINISTRATOR
fr: ADMINISTRATEUR

# ageLabel
source: Age:
de: Alter:
fr: Âge:

# backBtn
source: BACK
de: ZURÜCK
fr: DOS

# clearBtn
source: CLEAR
de: KLAR
fr: CLAIR

source: Congratulation!
de: Herzlichen Glückwunsch!
fr: Félicitation !

# createAccountTxt
source: Create an Account
de: Ein Konto Erstellen
fr: Créer un Compte

source: Criterion
de: Kriterium
fr: Critère

# deleteFailure
source: Deletion was ended with failure!
de: Der Löschvorgang wurde mit einem Fehler beendet!
fr: La suppression s'est soldée par un échec !

# deleteFailureSelectedPlayer
source: No player has been selected to be deleted!
de: Es wurde kein Spieler zum Löschen ausgewählt!
fr: Aucun joueur n'a été sélectionné pour être supprimé !

# deleteSuccess
source: Deletion was completed successfully!
de: Der Löschvorgang wurde erfolgreich abgeschlossen!
fr: La suppression a été effectuée avec succès !

source: Draw!
de: Ziehen!
fr: Dessiner!

# drawGame
source: Not Good not bad
de: Nicht gut nicht schlecht
fr: Pas bien pas mal

# editPlayerTitle
source: View and Edit players
de: Spieler anzeigen und bearbeiten
fr: Afficher et modifier les joueurs

source: Empty!
de: Leer!
fr: Vide!

source: English
de: Englisch
fr: Anglais

source: Exception!
de: Ausnahme!

# exitBtn
source: EXIT
de: AUSFAHRT
fr: SORTIE

# exitQuestion
source: Do you want to save your results?
de: Möchten Sie Ihre Ergebnisse speichern?
fr: Voulez-vous enregistrer vos résultats?

source: Failure!
de: Versagen!
fr: Échec!

source: French
de: Französisch
fr: Français

# fullNameLabel
source: Full Name:
de: Name:
fr: Nom:

source: Game notification!
de: Spielbenachrichtigung!
fr: Notification de jeu !

source: Game Over!
de: Spiel vorbei!
fr: Jeu terminé!

# gameTitle
source: Arrow Puzzle Game
de: Pfeil-Puzzlespiel
fr: Jeu de puzzle de flèche

source: German
de: Deutsch
fr: Allemande

# homeText11
source: - You have to place arrows strategically on the grid to fill it without having two arrows
de: - Sie müssen Pfeile strategisch auf dem Gitter platzieren, um es zu füllen, ohne dass zwei Pfeile vorhanden sind
fr: - Vous devez placer les flèches stratégiquement sur la grille pour la remplir sans avoir deux flèches

# homeText12
source: of the same color pointing in the same direction along any row, column, or diagonal.
de: derselben Farbe, die entlang einer beliebigen Zeile, Spalte oder Diagonale in die gleiche Richtung zeigt.
fr: de la même couleur pointant dans la même direction le long d’une ligne, d’une colonne ou d’une diagonale.

# homeText21
source: - Each player takes turns placing arrows on empty cells of the grid aiming to create a
de: - Jeder Spieler platziert abwechselnd Pfeile auf leere Felder des Gitters, um ein zu erschaffen
fr: - Chaque joueur place à tour de rôle des flèches sur des cellules vides de la grille dans le but de créer un

# homeText22
source: pattern that adheres to the rule mentioned above.
de: muster, das der oben genannten Regel entspricht.
fr: modèle qui adhère à la règle mentionnée ci-dessus.

# homeText31
source: - The game ends when one player can no longer make a legal move, resulting in their
de: - Das Spiel endet, wenn ein Spieler keinen legalen Zug mehr ausführen kann, was zu seinem
fr: - Le jeu se termine lorsqu'un joueur ne peut plus effectuer un mouvement légal, ce qui entraîne son

# hometext32
source: opponent winning
de: gegner gewinnt
fr: adversaire gagnant

# homeTitle
source: This is Arrow Puzzle Game
de: Dies ist ein Pfeil-Puzzlespiel
fr: C'est un jeu de Puzzle de Flèche

# incompleteInfo
source: Incomplete information!
de: Unvollständige Information!
fr: Information incomplète!

source: Leave Game!
de: Spiel verlassen!
fr: Quitter jeu!

# levelLabel
source: Level:
de: Ebene:
fr: Niveau:

# listPlayerEmpty
source: The list of players is empty!
de: Die Spielerliste ist leer!
fr: La liste des joueurs est vide !

# loginBtn
source: LOGIN
de: ANMELDUNG
fr: SE CONNECTER

# loginFailure
source: Login was ended with failure!
de: Die Anmeldung wurde mit Fehler beendet!
fr: La connexion s'est terminée avec un échec !

# loginText1
source: Don't have an account?
de: Sie haben noch kein Konto?
fr: Vous n'avez pas de compte ?

# loginText2
source: I just want to play the game!
de: Ich möchte das Spiel spielen!
fr: Je veux juste jouer au jeu!

# loginTitle
source: Welcome
de: Willkommen
fr: Bienvenue

# loginTxt
source: Login
de: Anmeldung
fr: Se Connecter

# lostGame
source: You have lost the game!
de: Du hast das Spiel verloren!
fr: Vous avez perdu la partie !

source: Not Allowed!
de: Nicht erlaubt!
fr: Interdit!

# notAllowedMessage
source: You don't have rights to access this page!
de: Sie haben keine Rechte, auf diese Seite zuzugreifen!
fr: Vous n'avez pas les droits pour accéder à cette page !

source: Not your turn!
de: Du bist nicht dran!
fr: Ce n'est pas votre tour !

# opoMovesLabel
source: Oponent moves:
de: Gegner bewegt sich:
fr: Adversaire mouvements:

# opoScoreLabel
source: Oponent score:
de: Gegners Punktestand:
fr: Score de l'adversaire:

# passwordLabel
source: Password:
de: Passwort:
fr: Mot de Passe

# pauseText
source: Game is paused!
de: Spiel ist pausiert!
fr: Le jeu est en pause !

source: Play!
de: Spielen!
fr: Jouer!

# playerdIDLabel
source: PlayerID:
de: Spieler-ID:
fr: JoueurID

# playerListEmpty
source: Players list is empty!
de: Die Spielerliste ist leer!
fr: La liste des joueurs est vide!

# playGameBtn
source: PLAY GAME
de: SPIEL SPIELEN
fr: JOUER AU JEU

# playGameTxt
source: Play Game
de: Spiel Spielen
fr: Jouer au Jeu

# playText
source: Game started!
de: Spiel gestartet!
fr: Le jeu a commencé !

# plyMovesLabel
source: Your moves:
de: Spieler bewegt sich:
fr: Vos mouvements:

# plyScoreLabel
source: Your score:
de: Ihr Punktestand:
fr: Ton score:

# rowSelError
source: Error at row selection!
de: Fehler bei der Zeilenauswahl!
fr: Erreur lors de la sélection de ligne !

# savedScoreLabel
source: Saved Score:
de: Punktzahl:
fr: Score enregistré:

# saveFailure
source: Saving the score was ended with failure!
de: Das Speichern der Partitur wurde mit einem Fehler beendet!
fr: La sauvegarde du score s'est soldée par un échec !

# saveSuccess
source: Saving the score was completed successfully!
de: Das Speichern der Partitur wurde erfolgreich abgeschlossen!
fr: La sauvegarde de la partition s'est terminée avec succès !

# scoreLabel
source: Score:
de: Punktzahl:

# searchBtn
source: SEARCH
de: SUCHEN
fr: RECHERCHE

# searchEmptyInfo
source: The searched information is empty!
de: Die gesuchten Informationen sind leer!
fr: Les informations recherchées sont vides !

# searchNoPlayerWithInfo
source: There is no player according to searched information!
de: Den gesuchten Informationen zufolge gibt es keinen Spieler!
fr: Il n'y a aucun joueur selon les informations recherchées !

# selectMove
source: Please select your move:
de: Bitte wählen Sie Ihren Umzug aus:
fr: Veuillez sélectionner votre déménagement :

# signOutBtn
source: SIGN OUT
de: ABMELDEN
fr: SE DÉCONNECTER

# signUpBtn
source: SIGNUP
de: ANHEUREN
fr: S'INSCRIRE

# signUpFailure
source: Creating new account was was ended with failure!
de: Das Erstellen eines neuen Kontos wurde mit einem Fehler beendet!
fr: La création d'un nouveau compte s'est soldée par un échec !

# signUpSuccess
source: New account was created successfully!
de: Neues Konto wurde erfolgreich erstellt!
fr: Le nouveau compte a été créé avec succès !

# signUpText
source: Already have an account?
de: Sie haben bereits ein Konto?
fr: Vous avez déjà un compte?

# signUpTitle
source: Create Account
de: Ein Konto Erstellen
fr: Créer un Compte

# startGameFirst
source: Please start the game first!
de: Bitte starten Sie zuerst das Spiel!
fr: Veuillez d'abord démarrer le jeu !

source: Statistics
de: Statistiken
fr: Statistiques

# statisticsBtn
source: STATISTICS
de: STATISTIKEN
fr: STATISTIQUES

source: Success!
de: Erfolg!
fr: Succès!

# updateFailure
source: Updating was ended with failure!
de: Das Update wurde mit einem Fehler beendet!
fr: La mise à jour s'est terminée avec un échec !

# updateFailureSelectedPlayer
source: No player has been selected to be updated!
de: Es wurde kein Spieler zum Aktualisieren ausgewählt!
fr: Aucun joueur n'a été sélectionné pour être mis à jour !

# updateSuccess
source: Updating was completed successfully!
de: Die Aktualisierung wurde erfolgreich abgeschlossen!
fr: La mise à jour s'est terminée avec succès !

# validinfoAge
source: Player age must be greater or equal with 10!
de: Das Spieleralter muss größer oder gleich 10 sein!
fr: L'âge du joueur doit être supérieur ou égal à 10 !

# validinfoEmail
source: Email field is empty!
de: E-Mail-Feld ist leer!
fr: Le champ email est vide !

# validinfoID
source: Player ID must be non-zero natural number!
de: Die Spieler-ID muss eine natürliche Zahl ungleich Null sein!
fr: L'ID du joueur doit être un nombre naturel différent de zéro !

# validinfoName
source: Player name is empty!
de: Spielername ist leer!
fr: Le nom du joueur est vide !

# validinfoPassword
source: Password field is empty!
de: Passwortfeld ist leer!
fr: Le champ du mot de passe est vide !

# validinfoScore
source: Player score must be greater or equal with 0!
de: Der Punktestand des Spielers muss größer oder gleich 0 sein!
fr: Le score du joueur doit être supérieur ou égal à 0 !

# winGame
source: You have win the game!
de: Du hast das Spiel gewonnen!
fr: Vous avez gagné la partie !

# emailLabel
source: Email:
fr: Courriel:

source: Error!
fr: Erreur!
